In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [4]:
persona = pd.read_csv("persona.csv")
df = persona.copy()
df.head()

   PRICE   SOURCE   SEX COUNTRY  AGE
0     39  android  male     bra   17
1     39  android  male     bra   17
2     49  android  male     bra   17
3     29  android  male     tur   17
4     49  android  male     tur   17

In [5]:
def grab_col_names(dataframe, cat_th=10, car_th=20):
    """ we can use this function for getting categorical, numerical, categorical but cardinal variables names
    Args:
    -------
        dataframe (pandas.DataFrame): all data
        cat_th ([int, floot], optional): 
        numeric fakat kategorik olan değişkenler için sınıf eşiği. Defaults to 10.   
        car_th ([int, floot], optional):
        katagorik fakat kardinal değişkenler için sınıf eşik değeri. Defaults to 20.
    Returns:
    -------
    cat_cols: List 
        kategorik değişken isimleri
    num_cols: List
        numerik değişken isimleri
    cat_but_car: List
        kategorik görünüp aslında kardinal olan değişken isimleri
    Notes:
    -------
        cat_cols + num_cols + cat_but_car = toplam değişken sayısı
        num_but_cat  cat_cols un içinde
        return olan üç liste toplamı toplam değişken sayısına eşittir.
    """
    # cat_cols, cat_but_car 
    cat_cols = [col for col in dataframe.columns if str(dataframe[col].dtypes) 
                in ["object", "category", "bool"]]
    num_but_cat = [col for col in dataframe.columns if dataframe[col].nunique() <  cat_th
                   and dataframe[col].dtypes in ["int64", "float64"]]
    cat_but_car = [col for col in dataframe.columns if dataframe[col].nunique() > car_th
                   and str(dataframe[col].dtypes) in ["object", "category"]]
    cat_cols = cat_cols + num_but_cat
    cat_cols = [col for col in cat_cols if col not in cat_but_car]
    # num_cols
    num_cols = [col for col in dataframe.columns if dataframe[col].dtypes 
            in ["int64", "float64"] and col not in cat_cols]
    print(f"Observations: {dataframe.shape[0]}")
    print(f"Variables: {dataframe.shape[1]}")
    print(f'cat_cols: {len(cat_cols)}')
    print(f'num_cols: {len(num_cols)}')
    print(f'cat_but_car: {len(cat_but_car)}')
    print(f'num_but_cat: {len(num_but_cat)}')
    return cat_cols, num_cols, cat_but_car

In [6]:
cat_cols, num_cols, cat_but_car = grab_col_names(df)

Observations: 5000
Variables: 5
cat_cols: 4
num_cols: 1
cat_but_car: 0
num_but_cat: 1

In [8]:
cat_cols

['SOURCE', 'SEX', 'COUNTRY', 'PRICE']

In [9]:
num_cols

['AGE']

In [10]:
cat_but_car

[]

In [11]:
def check_df(data_frame, head=5):
    print("##################### Shape #####################")
    print(data_frame.shape)
    print("##################### Types #####################")
    print(data_frame.dtypes)
    print("##################### Head #####################")
    print(data_frame.head(head))
    print("##################### Tail #####################")
    print(data_frame.tail(head))
    print("##################### NA #####################")
    print(data_frame.isnull().sum())
    print("##################### Describe #####################")
    print(data_frame.describe().T)

check_df(df)

##################### Shape #####################
(5000, 5)
##################### Types #####################
PRICE       int64
SOURCE     object
SEX        object
COUNTRY    object
AGE         int64
dtype: object
##################### Head #####################
   PRICE   SOURCE   SEX COUNTRY  AGE
0     39  android  male     bra   17
1     39  android  male     bra   17
2     49  android  male     bra   17
3     29  android  male     tur   17
4     49  android  male     tur   17
##################### Tail #####################
      PRICE   SOURCE     SEX COUNTRY  AGE
4995     29  android  female     bra   31
4996     29  android  female     bra   31
4997     29  android  female     bra   31
4998     39  android  female     bra   31
4999     29  android  female     bra   31
##################### NA #####################
PRICE      0
SOURCE     0
SEX        0
COUNTRY    0
AGE        0
dtype: int64
##################### Describe #####################
        count     mean        std   min   25%   50%   75%   max
PRICE  5000.0  34.1320  12.464897   9.0  29.0  39.0  39.0  59.0
AGE    5000.0  23.5814   8.995908  15.0  17.0  21.0  27.0  66.0

In [12]:
df["SOURCE"].nunique()

2

In [13]:
df["PRICE"].nunique()

6

In [14]:
cat_cols, num_cols, cat_but_car = grab_col_names(df, cat_th=6)

Observations: 5000
Variables: 5
cat_cols: 3
num_cols: 2
cat_but_car: 0
num_but_cat: 0

In [15]:
num_cols

['PRICE', 'AGE']

In [16]:
df["PRICE"].value_counts()

29    1305
39    1260
49    1031
19     992
59     212
9      200
Name: PRICE, dtype: int64

In [17]:
df["COUNTRY"].value_counts()

usa    2065
bra    1496
deu     455
tur     451
fra     303
can     230
Name: COUNTRY, dtype: int64

In [19]:
df.groupby("COUNTRY").agg({"PRICE": "sum"}).sort_values("PRICE", ascending=False)

         PRICE
COUNTRY
usa      70225
bra      51354
tur      15689
deu      15485
fra      10177
can       7730

In [20]:
df.groupby("SOURCE").agg({"PRICE": "count"}).sort_values(
    "PRICE", ascending=False)

         PRICE
SOURCE
android   2974
ios       2026

In [21]:
df.groupby("COUNTRY").agg({"PRICE": "mean"}).sort_values(
    "PRICE", ascending=False)

             PRICE
COUNTRY
tur      34.787140
bra      34.327540
deu      34.032967
usa      34.007264
can      33.608696
fra      33.587459

In [22]:
df.pivot_table(values="PRICE", index="SOURCE", aggfunc="mean")

             PRICE
SOURCE
android  34.174849
ios      34.069102

In [23]:
df.pivot_table(values="PRICE", index="COUNTRY", columns="SOURCE", aggfunc="mean")

SOURCE     android        ios
COUNTRY
bra      34.387029  34.222222
can      33.330709  33.951456
deu      33.869888  34.268817
fra      34.312500  32.776224
tur      36.229437  33.272727
usa      33.760357  34.371703

In [36]:
agg_df = df.pivot_table(
    values="PRICE", index=["COUNTRY", "SOURCE", "SEX", "AGE"], aggfunc="mean"
)

In [37]:
agg_df

                                PRICE
COUNTRY SOURCE  SEX    AGE
bra     android female 15   38.714286
                       16   35.944444
                       17   35.666667
                       18   32.255814
                       19   35.206897
...                               ...
usa     ios     male   42   30.250000
                       50   39.000000
                       53   34.000000
                       55   29.000000
                       59   46.500000

[348 rows x 1 columns]

In [38]:
agg_df = agg_df.sort_values("PRICE", ascending=False)

In [39]:
agg_df

                            PRICE
COUNTRY SOURCE  SEX    AGE
bra     android male   46    59.0
usa     android male   36    59.0
fra     android female 24    59.0
usa     ios     male   32    54.0
deu     android female 36    49.0
...                           ...
usa     ios     female 38    19.0
                       30    19.0
can     android female 27    19.0
fra     android male   18    19.0
deu     android male   26     9.0

[348 rows x 1 columns]

In [40]:
agg_df.reset_index(inplace=True)

In [41]:
agg_df

    COUNTRY   SOURCE     SEX  AGE  PRICE
0       bra  android    male   46   59.0
1       usa  android    male   36   59.0
2       fra  android  female   24   59.0
3       usa      ios    male   32   54.0
4       deu  android  female   36   49.0
..      ...      ...     ...  ...    ...
343     usa      ios  female   38   19.0
344     usa      ios  female   30   19.0
345     can  android  female   27   19.0
346     fra  android    male   18   19.0
347     deu  android    male   26    9.0

[348 rows x 5 columns]

In [43]:
age_labels = ["0_18", "19_23", "24_30", "31_40", "41_70"]

In [46]:
age_labels = ["0-18", "19-23", "24-30", "31-40", "41-70"]
agg_df["age_group"] = pd.cut(
    agg_df["AGE"], bins=[0, 18, 23, 30, 40, 70], labels=age_labels
)

agg_df.head()

  COUNTRY   SOURCE     SEX  AGE  PRICE age_group
0     bra  android    male   46   59.0     41-70
1     usa  android    male   36   59.0     31-40
2     fra  android  female   24   59.0     24-30
3     usa      ios    male   32   54.0     31-40
4     deu  android  female   36   49.0     31-40

In [48]:
agg_df["customers_level_based"] = (
    agg_df["COUNTRY"]
    + "_"
    + agg_df["SOURCE"]
    + "_"
    + agg_df["SEX"]
    + "_"
    + pd.cut(
        agg_df["AGE"],
        bins=[0, 18, 23, 30, 40, 70],
        labels=age_labels
    ).astype(str)
)

In [49]:
agg_df["customers_level_based"] = (
    agg_df.groupby("customers_level_based")["PRICE"]
    .transform("mean")
    .sort_values(ascending=False)
    .index
)

In [50]:
agg_df.head()

  COUNTRY   SOURCE     SEX  AGE  PRICE age_group  customers_level_based
0     bra  android    male   46   59.0     41-70                      2
1     usa  android    male   36   59.0     31-40                    249
2     fra  android  female   24   59.0     24-30                     13
3     usa      ios    male   32   54.0     31-40                     20
4     deu  android  female   36   49.0     31-40                     35

In [51]:
agg_df["SEGMENT"] = pd.qcut(agg_df["PRICE"], q=4, labels=["D", "C", "B", "A"])
# Segmentleri betimleme

segment_summary = agg_df.groupby("SEGMENT").agg(
    {"PRICE": ["mean", "min", "max", "count"]}
)

In [52]:
segment_summary

             PRICE
              mean        min        max count
SEGMENT
D        27.302596   9.000000  31.105263    87
C        32.933339  31.173913  34.000000    95
B        35.436170  34.185185  37.000000    81
A        41.434736  37.095238  59.000000    85